In [22]:
import pandas as pd
from sklearn import linear_model

In [23]:
df = pd.read_csv('homeprices.csv')
df.head(5)

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

**Get Dummy Variables**

In [24]:
dummies = pd.get_dummies(df.town)
dummies.head(3)

   monroe township  robinsville  west windsor
0                1            0             0
1                1            0             0
2                1            0             0

**Marged dummies to main data frame & drop ['town', 'west windsor']**

**->Drop 'west windsor' column for avoid dummy variables trap**

In [38]:
marged = pd.concat([df, dummies], axis='columns')
final = marged.drop(['town', 'west windsor'], axis='columns')
final

    area   price  monroe township  robinsville
0   2600  550000                1            0
1   3000  565000                1            0
2   3200  610000                1            0
3   3600  680000                1            0
4   4000  725000                1            0
5   2600  585000                0            0
6   2800  615000                0            0
7   3300  650000                0            0
8   3600  710000                0            0
9   2600  575000                0            1
10  2900  600000                0            1
11  3100  620000                0            1
12  3600  695000                0            1

**Pre-Processing for Linear Regression**

In [33]:
x = final.drop('price', axis='columns')
x.head(3)

   area  monroe township  robinsville
0  2600                1            0
1  3000                1            0
2  3200                1            0

In [34]:
y = df.price
y.head(3)

0    550000
1    565000
2    610000
Name: price, dtype: int64

In [36]:
model = linear_model.LinearRegression()
model.fit(x, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

**Predect price for '2800 area' in 'robinsville'**

In [37]:
model.predict([[2800, 1, 0]])

array([565089.22812299])